In [1]:
import pandas as pd
import numpy as np

In [10]:
df=pd.read_csv(r"D:\innomatics\movies.csv")
dt=pd.read_csv(r"D:\innomatics\ratings.csv")

In [11]:
df.shape

(9742, 3)

In [36]:
df.head(1080)

          movie  user_rating
0  Terminator 2          4.5
1  Terminator 2          5.0
2  Terminator 2          4.8
3  Terminator 2          3.5
4  Terminator 2          4.7

df

In [46]:
df.describe()

       user_rating
count     5.000000
mean      4.500000
std       0.587367
min       3.500000
25%       4.500000
50%       4.700000
75%       4.800000
max       5.000000

In [14]:
data = {'movie':['The Shawshank Redemption','The Godfather','Pulp Fiction'],
        'ratings':[5324, 4056, 3654]}

df = pd.DataFrame(data)

# Sort by ratings in descending order
df = df.sort_values('ratings', ascending=False)

# Get the title of the top movie
top_movie = df.iloc[0]['movie'] 

print(top_movie)

The Shawshank Redemption

In [15]:
import pandas as pd

# Sample dataset
data = {'movie': ['Terminator 2','Terminator 2','Terminator 2','Terminator 2','Terminator 2'],
        'user_rating': [4.5, 5, 4.8, 3.5, 4.7]} 

df = pd.DataFrame(data)

# Filter to only Terminator 2 rows
t2_ratings = df[df['movie'] == 'Terminator 2']

# Calculate average rating 
avg_rating = t2_ratings['user_rating'].mean()

print(avg_rating)

4.5

In [22]:
dt_sorted = dt.sort_values(by='rating', ascending=False)

In [18]:
dt

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [23]:
dt_sorted

       userId  movieId  rating   timestamp
34031     232     3147     5.0  1218164903
50717     328     1080     5.0  1494210450
18166     115      487     5.0   944951378
18165     115      480     5.0   944953733
76157     479     3308     5.0  1039362558
...       ...      ...     ...         ...
99278     608     4679     0.5  1117506642
99277     608     4678     0.5  1117506202
95668     600     4744     0.5  1237714406
99269     608     4621     0.5  1117506916
78499     489      168     0.5  1332774713

[100836 rows x 4 columns]

In [25]:
top_5_movies = dt_sorted.head(5)

# Display the top 5 movies
print(top_5_movies[['movieId', 'userId', 'rating']])

       movieId  userId  rating
34031     3147     232     5.0
50717     1080     328     5.0
18166      487     115     5.0
18165      480     115     5.0
76157     3308     479     5.0

In [45]:
search_movieid = 3147
result = df.loc[df['movie'] == search_movie_id]
result

Empty DataFrame
Columns: [movie, user_rating]
Index: []

          movie  user_rating
0  Terminator 2          4.5
1  Terminator 2          5.0
2  Terminator 2          4.8
3  Terminator 2          3.5
4  Terminator 2          4.7